
#Область СлужебныйПрограммныйИнтерфейс

Процедура СохранитьОписаниеСервисов() Экспорт
	
	КлючОбъекта = ФиктивныйКлючОбъекта();
	ИмяПользователя = ФиктивноеИмяПользователя();
	
	// Полная очистка сохраненных описаний
	ТекущиеОписанияСервисов = ХранилищеСистемныхНастроек.ПолучитьСписок(ФиктивныйКлючОбъекта(), ФиктивноеИмяПользователя());
	
	Для Каждого Элемент Из ТекущиеОписанияСервисов Цикл
		
		КлючСервиса = Элемент.Значение;
		
		ХранилищеСистемныхНастроек.Удалить(ФиктивныйКлючОбъекта(), КлючСервиса, ФиктивноеИмяПользователя());
		
	КонецЦикла;
	
	// Формирование новых описаний
	ОписанияСервисов = ОписаниеREST.ПолучитьОписанияСервисов();
	
	Для Каждого КЗ Из ОписанияСервисов Цикл
		
		КлючСервиса = КЗ.Ключ;
		ОписаниеСервиса = КЗ.Значение;
		
		ХранилищеСистемныхНастроек.Сохранить(КлючОбъекта, КлючСервиса, ОписаниеСервиса, , ИмяПользователя);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОписаниеСервиса(КлючСервиса) Экспорт
	
	КлючОбъекта = ФиктивныйКлючОбъекта();
	ИмяПользователя = ФиктивноеИмяПользователя();
	
	ОписаниеСервиса = ХранилищеСистемныхНастроек.Загрузить(КлючОбъекта, КлючСервиса, , ИмяПользователя);
	
	Возврат ОписаниеСервиса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФиктивныйКлючОбъекта()
	Возврат "e82c8ffc-194b-4221-8df5-171e9f9b7f52";
КонецФункции // ФиктивныйКлючОбъекта

Функция ФиктивноеИмяПользователя()
	Возврат "b9ae07e8-c406-404d-bd01-c373d8753286";
КонецФункции // ФиктивноеИмяПользователя

#КонецОбласти