
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСервисы

&НаКлиенте
Процедура СписокСервисыПриАктивизацииСтроки(Элемент)
	
	ТекущийСервис = Элементы.СписокСервисы.ТекущиеДанные.Ссылка;
	
	Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = ТекущийСервис;
	
КонецПроцедуры

#КонецОбласти