
#Область СлужебныйПрограммныйИнтерфейс

Функция РазделитьURL(URL) Экспорт
	Возврат СтрРазделить(URL, "/", Ложь);
КонецФункции

Функция ЭтоСлужебныйРесурс(ПутьРесурса) Экспорт
	
	СлужебныеПути = Новый Массив;
	СлужебныеПути.Добавить("/docs");
	СлужебныеПути.Добавить("/favicon-16x16.png");
	СлужебныеПути.Добавить("/favicon-32x32.png");
	СлужебныеПути.Добавить("/swagger-ui.css");
	СлужебныеПути.Добавить("/swagger-ui-bundle.js");
	СлужебныеПути.Добавить("/openapi.json");
	СлужебныеПути.Добавить("/health");
	
	Результат = (СлужебныеПути.Найти(ПутьРесурса) <> Неопределено);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПользовательскиеВидыОтветов() Экспорт
	
	Результат = Новый СписокЗначений;
	
	ПользовательскиеТипыОтветов = Перечисления.ТипыОтветовREST.ПолучитьПользовательскиеВидыОтветов();
	
	Для Каждого КЗ Из ПользовательскиеТипыОтветов Цикл
		Результат.Добавить(КЗ.Ключ, КЗ.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти